Autodesk.Navisworks.Api.SearchConditionCollection.Item(System.Int32)
Gets or sets the element at the specified index.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'item' has been Disposed
Throws System.ArgumentNullException:
Argument 'item' is null
Throws System.ArgumentException:
Argument 'item' is ReadOnly
Throws System.ArgumentOutOfRangeException:
Argument 'index' out of range